#########################################################################################################1
def my_func(x, y):
    result = 1
    for i in range(0, abs(y)):
        result *= x
    return round(1 / result, 8)


try:
    print(my_func(int(input('Введите положительное число: ')), int(input('Введите целое отрицательное число: '))))
except ValueError:
    print('Введите число!!!')
##########################################################################################################2
x = int(input('Введите положительное число: '))
y = int(input('Введите целое отрицательное число: '))
my_func_l = lambda x, y: x**y
print(my_func_l(x, y))